Revit 2027 API
ParameterTypeId.StairsAttrMaxRiserHeight Property
 "Maximum Riser Height"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsAttrMaxRiserHeight { get; }
Public Shared ReadOnly Property StairsAttrMaxRiserHeight As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsAttrMaxRiserHeight {
	ForgeTypeId^ get ();
}
static member StairsAttrMaxRiserHeight : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace